error_message = """Произошла ошибка при обработке вашего сообщения. Пожалуйста, попробуйте отправить его снова. Извините за неудобства! ⚠️"""

start_message = """
👋 Привет! Я ваш умный помощник, готовый помочь вам и отвечать на ваши вопросы!

💡 Я использую передовые технологии от OpenAI — модели GPT-4o и GPT-4o-mini:

GPT-4o-mini больше всего подходит для небольших повседневных задач. Стоит дёшево.

GPT-4o нужна для решения сложных и интеректуальных задача. Стоит дороже, чем GPT-4o-mini.

🔽 Выберите модель внизу на кнопках, и просто напишите мне, что вам нужно — я помогу вам!
"""


reset_context_message = "Контекст очищен. Я всё забыл, честно!"


about_message = """
Модели GPT (Generative Pre-trained Transformer) — это искусственные интеллектуальные языковые модели, разработанные OpenAI. Они способны генерировать текст, отвечать на вопросы и выполнять другие языковые задачи, обучаясь на больших объемах текстовых данных.

Вот модели, которые вы можете использовать в данном боте:

Модель: GPT-4o

    • Производительность: Обладает высокой производительностью и эффективностью при решении сложных задач, таких как глубокий анализ данных, разработка сложных алгоритмов и генерация текстов с высоким уровнем сложности. Она способна учитывать контекст и нюансы, что делает ее подходящей для более требовательных приложений.

    • Стоимость:
        Стоимость использования этой модели находится на среднем уровне. Она оправдывает свои затраты за счет высококачественных результатов и широты применения.

    • Скорость:
        Несмотря на свою мощность, модель работает медленнее по сравнению с меньшими моделями, что может быть связано с высокой сложностью выполняемых задач и объемом обрабатываемых данных.

    • Применение:
        Идеально подходит для научных исследований, где необходимы глубокие знания и аналитические способности. Она также используется для написания сложного кода, генерации креативного контента и разработки инновационных решений.

Модель: GPT-4o Mini

    • Производительность:
        Обладает более низкой производительностью по сравнению с GPT-4o, но все же достаточно эффективна для решения множества задач. Эта модель может использоваться для быстрого выполнения менее сложных заданий, не требующих глубокой аналитики.

    • Стоимость:
        Использование данной модели обходится значительно дешевле, что делает ее доступной для более широкого круга пользователей, включая малые и средние предприятия.

    • Скорость:
        Скорость работы GPT-4o Mini превышает скорость GPT-4o, что позволяет пользователям получать результаты быстрее, особенно для простых и менее ресурсоемких задач.

    • Применение:
        Эта модель отлично подходит для выполнения простых задач, таких как обработка текстов, составление резюме или ответы на вопросы. Также она может использоваться для мультимодальных задач, где не требуется высокая нагрузка на ресурсы, например, в чат-ботах или для генерации простого контента.

Эти более подробные описания помогут лучше понять различия и области применения каждой модели.
"""
