error = """⚠️ Произошла ошибка при обработке вашего сообщения. Пожалуйста, попробуйте отправить его снова. Извините за неудобства!"""

start = """
👋 Привет! Я ваш умный помощник, готовый помочь вам и отвечать на ваши вопросы!

💡 Я использую передовые технологии от OpenAI — модели GPT-4o и GPT-4o-mini:

GPT-4o-mini больше всего подходит для небольших повседневных задач. Использует мало токенов, т.е стоит дешево.

GPT-4o нужна для решения сложных и интеректуальных задача. Использует много токенов, т.е стоит дороже, чем GPT-4o-mini.

🔽 Выберите модель внизу на кнопках, и просто напишите мне, что вам нужно — я помогу вам!
"""
